{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Привет",
        "Здравствуй",
        "Как дела?",
        "Есть кто-нибудь?",
        "Приветствую",
        "Добрый день"
      ],
      "responses": [
        "Привет! Чем могу помочь в разработке и развитии методов интеллектуальной поддержки модернизации технических систем?",
        "Приветствую! В чем ваш запрос по разработке и развитию методов интеллектуальной поддержки модернизации технических систем?",
        "Привет! Как я могу помочь в разработке и развитии методов интеллектуальной поддержки модернизации технических систем?",
        "Привет! Рады видеть вас здесь. Чем могу помочь в вопросах разработки и развития методов интеллектуальной поддержки модернизации технических систем?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Пока", "Увидимся позже", "До свидания"],
      "responses": [
        "До свидания! Если у вас возникнут еще вопросы по разработке и развитию методов интеллектуальной поддержки модернизации технических систем, обращайтесь!",
        "Хорошего дня! Не забывайте обращаться, если у вас возникнут вопросы по разработке и развитию методов интеллектуальной поддержки модернизации технических систем.",
        "Пока! Возвращайтесь снова скоро. Если у вас будут вопросы по разработке и развитию методов интеллектуальной поддержки модернизации технических систем, обращайтесь!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Спасибо", "Благодарю", "Это полезно", "Большое спасибо!"],
      "responses": ["Рады были помочь в вопросах разработки и развития методов интеллектуальной поддержки модернизации технических систем!", "Всегда рады помочь!", "Пожалуйста! Обращайтесь, если у вас возникнут еще вопросы по разработке и развитию методов интеллектуальной поддержки модернизации технических систем!"]
    },
    {
      "tag": "items",
      "patterns": [
        "Какие методы поддержки вы разрабатываете?",
        "Какие инновации в разработке вы предлагаете?",
        "Какие технологии вы используете?"
      ],
      "responses": [
        "Мы работаем над разработкой и развитием методов интеллектуальной поддержки модернизации технических систем.",
        "Наша компания специализируется на инновационных методах поддержки развития технических систем.",
        "Мы предлагаем использование передовых технологий для интеллектуальной поддержки модернизации технических систем."
      ]
    },
    {
      "tag": "payments",
      "patterns": [
        "Какие методы оплаты вы принимаете?",
        "Можно ли оплатить кредитной картой?",
        "Принимаете ли вы электронные платежи?"
      ],
      "responses": [
        "Мы принимаем оплату различными способами, включая кредитные карты, электронные платежи и наличные.",
        "Оплата возможна кредитными картами, электронными платежами и наличными.",
        "Мы готовы принять оплату как кредитными картами, так и через электронные платежные системы."
      ]
    },
    {
      "tag": "delivery",
      "patterns": [
        "Каковы сроки доставки?",
        "Когда я получу результаты разработки?"
      ],
      "responses": [
        "Сроки доставки зависят от конкретного проекта и обсуждаются индивидуально.",
        "После завершения разработки мы согласуем с вами сроки доставки результатов проекта."
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Расскажи шутку!",
        "Расскажи что-нибудь смешное!",
        "Знаешь забавный факт?"
      ],
      "responses": [
        "Как называют программиста, который не умеет плавать? - Баг-плаватель!",
        "Смешной факт: Люди считают, что программисты все время пишут код, но на самом деле мы проводим больше времени, дебажа его."
      ]
    }
  ]
}